Revit 2027 API
SpatialFieldManager.LegendShowConfigurationName Property
 If true legend contains analysis configuration name.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool LegendShowConfigurationName { get; set; }
Public Property LegendShowConfigurationName As Boolean
	Get
	Set
public:
property bool LegendShowConfigurationName {
	bool get ();
	void set (bool value);
}
member LegendShowConfigurationName : bool with get, set
Property Value
Boolean
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace